# RebarShapeVertex Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeVertex Members
RebarShapeVertex Class Methods Properties See Also
---
The RebarShapeVertex type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RebarShapeVertex |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetConstraints | Retrieve the list of constraints associated with this vertex. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetConstraints | Assign a new list of constraints to this vertex. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BendAngle | The range of permissible angles at this bend. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Turn | The sense of the turn. The Turn property must be set to Left or Right on each internal vertex before the RebarShapeDefinitionBySegments is used. Default is permissible for the first and last vertex, since they do not correspond to bends. |

# See Also
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace